In [97]:
# Importing the libraries to be used
import pandas as pd
import numpy as np

In [98]:
# Loading telcom dataset 1
data_1 = pd.read_csv('D:/veronica_moringa/project_dsp/data/Telcom_dataset_1.csv')
data_1.head()

,PRODUTC,VALUE,DATETIME,CELL_ON_SITE,DW_A_NUMBER_INT,DW_B_NUMBER_INT,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,Voice,0,04:37.0,1,49fae048b547780,1a49f8b0ded9de6,19e2e,19e2e,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,05:25.0,0,7a54a6eaee19e65,93343ba6e41af95,19e2e,19e2e,/+cKZKIp41,/+cKZKIp41
2,sms,25,05:41.0,0,6008887b0207d82,7aacc9709ce0a20,19e2e,19e2e,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,05:42.0,1,7370032e20f4e96,6af4a60e74c91d3,19e2e,19e2e,#NAME?,#NAME?
4,Voice,14,06:29.0,1,966ba4656e38e62,02aa736ee555d5c,19e2e,19e2e,051KhYDCpv,051KhYDCpv

In [99]:
# Loading telcom dataset 2
data_2 = pd.read_csv('D:/veronica_moringa/project_dsp/data/Telcom_dataset2.csv')
data_2.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,DW_A_NUMBER,DW_B_NUMBER,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,sms,0,02:06.0,2,32255675c3b6fe3,1aa7ae01386e9fb,19e2e,19e2e,+854AcBQT2,+854AcBQT2
1,Voice,0,03:44.0,1,ff16d6ac74c1c64,87d87309c15a8c9,19e2e,19e2e,+854AcBQT2,+854AcBQT2
2,sms,0,04:06.0,0,98d9f2fb5ff624b,93343ba6e41af95,19e2e,19e2e,#NAME?,#NAME?
3,Voice,37,04:48.0,1,3f9c8a33ec7be1f,7d05a38f89c49d8,19e2e,19e2e,/xvRrCVKoQ,/xvRrCVKoQ
4,sms,25,04:58.0,1,7bcccc03adf3864,56a5d5430d2fa86,19e2e,19e2e,#NAME?,#NAME?

In [100]:
# Loading telcom dataset 3
data_3 = pd.read_csv('D:/veronica_moringa/project_dsp/data/Telcom_dataset3.csv')
data_3.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,DW_A_NUMBER_INT,DW_B_NUMBER_INT,COUNTRY_A,COUNTRY_B,CELLID,SIET_ID
0,Voice,61,01:28.0,2,966f68353622feb,ffd53a3bb2db6f1,19e2e,19e2e,+38u2u/rfx,+38u2u/rfx
1,sms,0,01:31.0,1,a0a597384c612d7,cf3b218f1dde792,19e2e,19e2e,#NAME?,#NAME?
2,Voice,10,02:59.0,1,5441a9a58c97132,52f8b299515b9b7,19e2e,19e2e,+ZaaZozy/+,+ZaaZozy/+
3,sms,0,03:04.0,0,8ab8b9ed6989f61,e09e736e46c5c3d,19e2e,19e2e,#NAME?,#NAME?
4,Voice,22,03:16.0,4,52662a62b199334,2186273faab4602,19e2e,19e2e,/eeMklgyJA,/eeMklgyJA

In [101]:
# Loading telcom dataset 4
data_4 = pd.read_excel('D:/veronica_moringa/project_dsp/data/CDR_description.xlsx')
data_4.head(10)

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String
5  DW_B_NUMBER_INT        Anonymized phone number of the counterparty   String
6        COUNTRY_A                  Country of party A (useless here)   String
7        COUNTRY_B                  Country of party B (useless here)   String
8          CELL_ID                                     ID of the cell   String
9          SITE_ID                                     ID of the SITE   String

In [102]:
# Loading telcom dataset 5
data_5 = pd.read_excel('D:/veronica_moringa/project_dsp/data/cells_geo_description.xlsx')
data_5.head(11)

     Column name                                        Description  Format
0         VILLES                                               City  String
1         STATUS                                  In Service or not  String
2   LOCALISATION                                  in ABIDJAN or not  String
3     DECOUPZONE                                  Geographical Zone  String
4       ZONENAME                                       Name of Zone  String
5      LONGITUDE                                          Longitude   Float
6       LATITUDE                                           Latitude   Float
7         REGION                                             Region  String
8           AREA                                               Area  String
9        CELL_ID                                     ID of the cell  String
10     SITE_CODE  Site (there are several cells per site, severa...  String

In [138]:
# Loading telcom dataset 6

data_6 = pd.read_csv('D:/veronica_moringa/project_dsp/data/cells_geo.csv', delimiter=';', index_col=0)

data_6.head()

,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_CODE
0,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,fbb2e75af3,0bb492ef17
1,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,1502501d78,0bb492ef17
2,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,0c2e182a0c,0bb492ef17
3,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,69bdfc69fd,8a1e6ce31f
4,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,7a1029d2ab,8a1e6ce31f

In [105]:
data_1.shape

(5001, 10)

In [106]:
data_2.shape

(5001, 10)

In [107]:
data_3.shape

(5001, 10)

In [108]:
data_4.shape

(10, 3)

In [109]:
data_5.shape

(11, 3)

In [139]:
data_6.shape

(3974, 11)

In [140]:
# Cleaning the three datasets
# 1. Rename column 1 and 3 to 'PRODUCT' and 'DATE_TIME' respectively in dataset 1
data_1a = data_1.rename(columns={"PRODUTC":"PRODUCT", "DATETIME": "DATE_TIME"})
data_1a.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,DW_A_NUMBER_INT,DW_B_NUMBER_INT,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,Voice,0,04:37.0,1,49fae048b547780,1a49f8b0ded9de6,19e2e,19e2e,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,05:25.0,0,7a54a6eaee19e65,93343ba6e41af95,19e2e,19e2e,/+cKZKIp41,/+cKZKIp41
2,sms,25,05:41.0,0,6008887b0207d82,7aacc9709ce0a20,19e2e,19e2e,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,05:42.0,1,7370032e20f4e96,6af4a60e74c91d3,19e2e,19e2e,#NAME?,#NAME?
4,Voice,14,06:29.0,1,966ba4656e38e62,02aa736ee555d5c,19e2e,19e2e,051KhYDCpv,051KhYDCpv

In [141]:
# 2. Rename column 5 and 6 in dataset 2 to read 'DW_A_NUMBER_INT' and 'DW_B_NUMBER_INT' respectively
data_2b = data_2.rename(columns={"DW_A_NUMBER":"DW_A_NUMBER_INT", "DW_B_NUMBER":"DW_B_NUMBER_INT"})
data_2b.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,DW_A_NUMBER_INT,DW_B_NUMBER_INT,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,sms,0,02:06.0,2,32255675c3b6fe3,1aa7ae01386e9fb,19e2e,19e2e,+854AcBQT2,+854AcBQT2
1,Voice,0,03:44.0,1,ff16d6ac74c1c64,87d87309c15a8c9,19e2e,19e2e,+854AcBQT2,+854AcBQT2
2,sms,0,04:06.0,0,98d9f2fb5ff624b,93343ba6e41af95,19e2e,19e2e,#NAME?,#NAME?
3,Voice,37,04:48.0,1,3f9c8a33ec7be1f,7d05a38f89c49d8,19e2e,19e2e,/xvRrCVKoQ,/xvRrCVKoQ
4,sms,25,04:58.0,1,7bcccc03adf3864,56a5d5430d2fa86,19e2e,19e2e,#NAME?,#NAME?

In [142]:
# 3. Rename columns 9 and 10 in dataset 3 to read 'CELL_ID' and 'SITE_ID'
data_3c = data_3.rename(columns={"CELLID":"CELL_ID", "SIET_ID":"SITE_ID"})
data_3c.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,DW_A_NUMBER_INT,DW_B_NUMBER_INT,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,Voice,61,01:28.0,2,966f68353622feb,ffd53a3bb2db6f1,19e2e,19e2e,+38u2u/rfx,+38u2u/rfx
1,sms,0,01:31.0,1,a0a597384c612d7,cf3b218f1dde792,19e2e,19e2e,#NAME?,#NAME?
2,Voice,10,02:59.0,1,5441a9a58c97132,52f8b299515b9b7,19e2e,19e2e,+ZaaZozy/+,+ZaaZozy/+
3,sms,0,03:04.0,0,8ab8b9ed6989f61,e09e736e46c5c3d,19e2e,19e2e,#NAME?,#NAME?
4,Voice,22,03:16.0,4,52662a62b199334,2186273faab4602,19e2e,19e2e,/eeMklgyJA,/eeMklgyJA

In [143]:
# Merger the three datasets using concat function
concatenated = pd.concat([data_1a, data_2b, data_3c])

In [144]:
concatenated.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,DW_A_NUMBER_INT,DW_B_NUMBER_INT,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,Voice,0,04:37.0,1,49fae048b547780,1a49f8b0ded9de6,19e2e,19e2e,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,05:25.0,0,7a54a6eaee19e65,93343ba6e41af95,19e2e,19e2e,/+cKZKIp41,/+cKZKIp41
2,sms,25,05:41.0,0,6008887b0207d82,7aacc9709ce0a20,19e2e,19e2e,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,05:42.0,1,7370032e20f4e96,6af4a60e74c91d3,19e2e,19e2e,#NAME?,#NAME?
4,Voice,14,06:29.0,1,966ba4656e38e62,02aa736ee555d5c,19e2e,19e2e,051KhYDCpv,051KhYDCpv

In [145]:
data_6.describe()

         LONGITUDE     LATITUDE
count  3974.000000  3974.000000
mean     -4.877659     6.244749
std       1.300771     1.304199
min      -8.503889     0.000000
25%      -5.846139     5.338639
50%      -4.084500     5.475000
75%      -3.993444     6.872306
max      -0.000000    10.481861

In [146]:
# Checking the total rows with missing data in the concatenated datasets
concatenated.isnull().sum()
# Dropping rows that contain missing data
concatenatedf= concatenated.dropna()

In [147]:
data_6.head()

,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_CODE
0,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,fbb2e75af3,0bb492ef17
1,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,1502501d78,0bb492ef17
2,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,0c2e182a0c,0bb492ef17
3,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,69bdfc69fd,8a1e6ce31f
4,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,7a1029d2ab,8a1e6ce31f

In [148]:
# Change column site code to site id
data_6d = data_6.rename(columns={"SITE_CODE": "SITE_ID"})
data_6d.head()

,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_ID
0,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,fbb2e75af3,0bb492ef17
1,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,1502501d78,0bb492ef17
2,ADJAME,In Service,ABIDJAN,"""Abidjan_EST",AGBANNEW,-4.000667,5.368194,LAGUNE,NaN,0c2e182a0c,0bb492ef17
3,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,69bdfc69fd,8a1e6ce31f
4,ASSINIE,In Service,INTERIEUR,Grand-EST,"ASSINIE""",-3.488467,5.158761,SUD COMOE,NaN,7a1029d2ab,8a1e6ce31f

In [149]:
# Find the total missing values in dataset 6d
data_6d.isnull().sum()
# Dropping rows that contain missing data
data_6a= data_6d.dropna()

In [150]:
# Remove duplicate values
data_6a.duplicated().sum()
data_6a2 = data_6a.drop_duplicates()
data_6a2.head()

,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,LONGITUDE,LATITUDE,REGION,AREA,CELL_ID,SITE_ID
23,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,-4.014139,5.4335,LAGUNE,ABIDJAN NORTH,f740406877,0f34c36ac5
24,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,-4.014139,5.4335,LAGUNE,ABIDJAN NORTH,959e54c8f7,0f34c36ac5
25,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,-4.014139,5.4335,LAGUNE,ABIDJAN NORTH,56b7e7000c,0f34c36ac5
26,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,-4.014139,5.4335,LAGUNE,ABIDJAN NORTH,bc51c17a6f,0f34c36ac5
27,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,-4.014139,5.4335,LAGUNE,ABIDJAN NORTH,e460975c9f,0f34c36ac5

In [151]:
# Find and remove duplicates in concatenatedf dataset
concatenatedf.duplicated().sum()
final_1 = concatenatedf.drop_duplicates()
final_1.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,DW_A_NUMBER_INT,DW_B_NUMBER_INT,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,Voice,0,04:37.0,1,49fae048b547780,1a49f8b0ded9de6,19e2e,19e2e,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,05:25.0,0,7a54a6eaee19e65,93343ba6e41af95,19e2e,19e2e,/+cKZKIp41,/+cKZKIp41
2,sms,25,05:41.0,0,6008887b0207d82,7aacc9709ce0a20,19e2e,19e2e,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,05:42.0,1,7370032e20f4e96,6af4a60e74c91d3,19e2e,19e2e,#NAME?,#NAME?
4,Voice,14,06:29.0,1,966ba4656e38e62,02aa736ee555d5c,19e2e,19e2e,051KhYDCpv,051KhYDCpv

In [152]:
# Checking if my final_1 dataset has any null values
final_1.isnull().values.any()

False

In [153]:
# Checking if my data_6a2 dataset has any null values
data_6a2.isnull().values.any()

False

In [154]:
# Drop columns on final_1 dataset
df=final_1.drop(columns=['DW_A_NUMBER_INT', 'DW_B_NUMBER_INT'])
df.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID
0,Voice,0,04:37.0,1,19e2e,19e2e,/TJNe+Mmtu,/TJNe+Mmtu
1,sms,0,05:25.0,0,19e2e,19e2e,/+cKZKIp41,/+cKZKIp41
2,sms,25,05:41.0,0,19e2e,19e2e,/u0FSD+ahi,/u0FSD+ahi
3,Voice,56,05:42.0,1,19e2e,19e2e,#NAME?,#NAME?
4,Voice,14,06:29.0,1,19e2e,19e2e,051KhYDCpv,051KhYDCpv

In [161]:
# Drop columns on data_6a2
data_6f=data_6a2.drop(columns=['LONGITUDE', 'LATITUDE', 'REGION', 'CELL_ID'])
data_6f.head()
data_6f.columns

Index(['VILLES', 'STATUS', 'LOCALISATION', 'DECOUPZONE', 'ZONENAME', 'AREA',
       'SITE_ID'],
      dtype='object')

In [157]:
# Merge data_6f and df on site_id
final_df = df.merge(data_6f, how="right", on = 'SITE_ID')
final_df.head()

,PRODUCT,VALUE,DATE_TIME,CELL_ON_SITE,COUNTRY_A,COUNTRY_B,CELL_ID,SITE_ID,VILLES,STATUS,LOCALISATION,DECOUPZONE,ZONENAME,AREA
0,sms,0.0,00:16.0,0,19e2e,19e2e,e12d87c801,0f34c36ac5,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,ABIDJAN NORTH
1,sms,0.0,00:20.0,0,19e2e,19e2e,e12d87c801,0f34c36ac5,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,ABIDJAN NORTH
2,sms,0.0,00:20.0,0,19e2e,19e2e,e12d87c801,0f34c36ac5,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,ABIDJAN NORTH
3,sms,0.0,00:22.0,0,19e2e,19e2e,e12d87c801,0f34c36ac5,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,ABIDJAN NORTH
4,Voice,14.0,00:37.0,1,19e2e,19e2e,10ae6c0752,0f34c36ac5,ABOBO,In Service,ABIDJAN,Abidjan_NORD,ZONE E - Abidjan_NORD,ABIDJAN NORTH

In [160]:
# Most used city in the three days
#Descriptive statistics between our city and Values column 
most_used_city=final_df['VALUE'].groupby(final_df['VILLES']).describe()
most_used_city.head(5)

                count       mean         std  min  25%   50%   75%     max
VILLES
ABENGOUROU      180.0  47.683333   86.372228  0.0  7.5  25.0  25.0   480.0
ABOBO          5922.0  20.109085  114.696913  0.0  0.0   0.0  25.0  3380.0
ABOISSO          90.0  18.333333   45.565609  0.0  0.0   0.0   8.0   180.0
ABOISSO COMOE    18.0  44.166667   58.692870  0.0  0.0  12.5  90.0   150.0
ABONGOUA          3.0   1.000000    0.000000  1.0  1.0   1.0   1.0     1.0

In [179]:
#Cheking which cities were the most used using the Value column
# From the description dataset, the value column is the billing price so the city with the highest billing price might be having the most users
billing = final_df['VILLES'].groupby(final_df['VALUE'])
billing

# Displaying the max value of the each city
billing.max().tail()

VALUE
2120.0    TREICHVILLE
2212.0        DAOUKRO
2330.0        SIPILOU
3380.0          ABOBO
6750.0         COCODY
Name: VILLES, dtype: object

In [184]:
# Cities most used during business and home hours
bizhomehours = final_df["VILLES"].groupby(final_df["DATE_TIME"])
bizhomehours

#Displaying the most used city during the business hours
bizhomehours.max().tail()

DATE_TIME
01:50.0      ZAROKO
01:51.0     ZIKISSO
01:52.0    YOPOUGON
01:53.0     ZIKISSO
01:54.0       ZADDI
Name: VILLES, dtype: object

In [183]:
# Displaying cities used during home hours
bizhomehours.max().head()

DATE_TIME
00:00.0    YOPOUGON
00:01.0       ZAGNE
00:02.0    ZUENOULA
00:03.0    YOPOUGON
00:04.0    ZUENOULA
Name: VILLES, dtype: object

In [185]:
#Find the most used city in the three days
freq = final_df["VILLES"].value_counts() 
print(freq)

YOPOUGON    8264
ABOBO       5934
COCODY      3720
ADJAME      2390
KOUMASSI    2280
            ...
BINAO          3
KRIKOREA       2
DANANON        2
KOTOULA        2
OUANGOLO       1
Name: VILLES, Length: 501, dtype: int64

In [208]:
#Finding the city with the least cells on site and determining their values on different #products. 
leastcells = final_df.groupby(["VILLES", "CELL_ON_SITE", "VALUE", "PRODUCT"]).agg({"VALUE": ['mean', 'min', 'max']})
leastcells

#Displaying the most used city with least cells
leastcells.head(100)

                                       VALUE
                                        mean    min    max
VILLES     CELL_ON_SITE VALUE PRODUCT
ABENGOUROU 0            0.0   Voice      0.0    0.0    0.0
                              sms        0.0    0.0    0.0
                        17.0  Voice     17.0   17.0   17.0
                        25.0  sms       25.0   25.0   25.0
                        196.0 Voice    196.0  196.0  196.0
...                                      ...    ...    ...
ABOBO      1            20.0  Voice     20.0   20.0   20.0
                        24.0  Voice     24.0   24.0   24.0
                        25.0  Voice     25.0   25.0   25.0
                              sms       25.0   25.0   25.0
                        26.0  Voice     26.0   26.0   26.0

[100 rows x 3 columns]

In [213]:
#Finding the city with the most cells on site and determining their values on different #products. 
mostcells = final_df.groupby(["VILLES", "CELL_ON_SITE", "VALUE", "PRODUCT"]).agg({"VALUE": ['mean', 'min', 'max']})
mostcells

#Displaying the most used city with least cells
mostcells.tail(100)

                                       VALUE
                                        mean     min     max
VILLES   CELL_ON_SITE VALUE  PRODUCT
YOPOUGON 4            422.0  Voice     422.0   422.0   422.0
                      1036.0 Voice    1036.0  1036.0  1036.0
         5            0.0    Voice       0.0     0.0     0.0
                             sms         0.0     0.0     0.0
                      1.0    Voice       1.0     1.0     1.0
...                                      ...     ...     ...
ZUENOULA 2            35.0   Voice      35.0    35.0    35.0
                      38.0   Voice      38.0    38.0    38.0
                      44.0   Voice      44.0    44.0    44.0
                      119.0  Voice     119.0   119.0   119.0
                      476.0  Voice     476.0   476.0   476.0

[100 rows x 3 columns]

In [219]:

# Which product is the most used in the cities
product = final_df['VILLES'].groupby(final_df['PRODUCT']).describe()
product

         count unique       top  freq
PRODUCT
Voice    20592    366  YOPOUGON  2891
sms      27965    231  YOPOUGON  5367

In [223]:
# Which city had the most valuie in the product
most_value = final_df['VILLES'].groupby(final_df['VALUE']).describe()
most_value

KeyError: ('VILLES', 'PRODUCT')